ZiChuan-cen/STM32-Develop/标准库开发/14-ADC/ADC-三重模式-交替采集/User/main.c
#include "stm32f4xx.h"
#include "bsp_debug_usart.h"
#include "bsp_adc.h"

// ADC1转换的电压值通过MDA方式传到SRAM
extern __IO uint32_t ADC_ConvertedValue[3];

// 局部变量，用于保存转换计算后的电压值 	 
float ADC_ConvertedValueLocal[3]; 

static void Delay(__IO uint32_t nCount)	 //简单的延时函数
{
	for(; nCount != 0; nCount--);
}



int main(void)
{
	
	Debug_USART_Config();    /* 初始化USART 配置模式为 115200 8-N-1，中断接收 */  
	
	Rheostat_Init();	
	while (1)
  {
    Delay(0xffffee);  
    
	  
	//强制转换为16位,所以只保留 低16位
    ADC_ConvertedValueLocal[0] =(float)((uint16_t)ADC_ConvertedValue[0]*3.3/4096); 
    ADC_ConvertedValueLocal[1] =(float)((uint16_t)ADC_ConvertedValue[1]*3.3/4096);
    ADC_ConvertedValueLocal[2] =(float)((uint16_t)ADC_ConvertedValue[2]*3.3/4096);
    
    printf("\r\n The current AD value = 0x%08X \r\n", ADC_ConvertedValue[0]); 
    printf("\r\n The current AD value = 0x%08X \r\n", ADC_ConvertedValue[1]); 
    printf("\r\n The current AD value = 0x%08X \r\n", ADC_ConvertedValue[2]); 
    
    printf("\r\n The current ADC1 value = %f V \r\n",ADC_ConvertedValueLocal[0]); 
    printf("\r\n The current ADC3 value = %f V \r\n",ADC_ConvertedValueLocal[1]);
    printf("\r\n The current ADC2 value = %f V \r\n",ADC_ConvertedValueLocal[2]);
  }
	
		
}


